Tekla.Structures.DrawingInternal.IDocumentManagerController
Interface for the DocumentManagerController.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.DrawingInternal.IDocumentManagerController.DrawingChanged
Drawing changed event.

Tekla.Structures.DrawingInternal.IDocumentManagerController.ShowWindowRequested
Show window requested event.

Tekla.Structures.DrawingInternal.IDocumentManagerController.ShowWindow
The show window function.

Tekla.Structures.DrawingInternal.IDocumentManagerController.GetSelectedDrawingGuids
The selected drawing guids function.
Returns: The selected drawing guids.

Tekla.Structures.DrawingInternal.IDocumentManagerController.SetSelectedDrawings(System.Collections.Generic.IEnumerable{System.Int32})
Set selected drawings.
drawingIds: The drawing ids.

Tekla.Structures.DrawingInternal.IDocumentManagerController.GetVisibleDrawingIds
The visible drawing ids function.
Returns: The visible drawing ids.

Tekla.Structures.DrawingInternal.IDocumentManagerController.UpdateDocumentManager(System.Boolean,System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32)
Update document manager.
newDrawingIsNotNull: Whether the new drawing is not null.
newId: The new id.
newType: The new type.
oldDrawingIsNotNull: Whether the old drawing is not null.
oldId: The old id.
oldType: The old type.